[
  {"start": 24.02, "end": 25.06, "text": "Tikrai ne magija."},
  {"start": 33.15, "end": 33.85, "text": "Gerai, man tai patinka."},
  {"start": 45.39, "end": 46.73, "text": "Taip, svarbu suprasti pagrindus."},
  {"start": 57.9, "end": 58.96, "text": "Skamba gerai. Pasiruošusi pradėti."},
  {"start": 66.99, "end": 68.99, "text": "O, be abejo. Tai visa sistema."},
  {"start": 68.99, "end": 79.58, "text": " Tai žingsniai, kuriuos atliekate, visų dalyvių vaidmenys, tikri produktai, kuriuos sukuriate procese, darbo eiliškumas ir kaip visa tai sujungia sistemą."},
  {"start": 86.4, "end": 87.96, "text": "Įsivaizduokite, kad kuriate programėlę."},
  {"start": 87.96, "end": 92.78, "text": " Pirmiausia turite išsiaiškinti, ką ji turėtų daryti, kokia jos paskirtis."},
  {"start": 93.85, "end": 96.36, "text": "Būtent. Tuomet pereinate prie projektavimo etapo."},
  {"start": 96.36, "end": 97.34, "text": " Kaip ji veiks?"},
  {"start": 97.34, "end": 98.32, "text": " Kaip ji atrodys?"},
  {"start": 98.32, "end": 102.68, "text": " Tada prasideda realus kūrimas – programavimas, kodavimas."},
  {"start": 102.68, "end": 107.34, "text": " Bet kai jau kažką sukuriate, turite įsitikinti, kad tai veikia."},
  {"start": 108.48, "end": 111.24, "text": "Testavimas. Ir, žinoma, programinė įranga niekada nebūna visiškai baigta."},
  {"start": 111.24, "end": 112.44, "text": " Ji nuolat tobulinama."},
  {"start": 112.44, "end": 115.82, "text": " Ją reikia prižiūrėti, taisyti klaidas, atnaujinti."},
  {"start": 115.82, "end": 124.19, "text": " O be viso techninio darbo, yra ir valdymo aspektas – projekto valdymas, kad viskas vyktų sklandžiai, kokybės kontrolė, kad užtikrintume gerą rezultatą."},
  {"start": 124.19, "end": 127.79, "text": " Konfigūracijos valdymas, kad suvaldytume visas versijas ir pakeitimus."},
  {"start": 127.79, "end": 132.5, "text": " Ir net proceso tobulinimas – kaip galime kitą kartą viską padaryti dar geriau?"},
  {"start": 137.28, "end": 137.58, "text": "Be abejo."},
  {"start": 140.06, "end": 142.02, "text": "Tai yra konkretūs dalykai, kuriuos sukuriame procese."},
  {"start": 142.42, "end": 147.67, "text": "Viskas prasideda nuo reikalavimų dokumento – išsamaus aprašymo, ką programinė įranga turėtų daryti."},
  {"start": 147.67, "end": 152.79, "text": " Supratau. Remdamiesi tuo, pereinate prie projektavimo ir gaunate projektavimo dokumentus, tarsi brėžinius."},
  {"start": 153.53, "end": 156.26, "text": "Diagramos, parodančios, kaip skirtingos dalys bus sujungtos."},
  {"start": 156.26, "end": 162.92, "text": " Šie dokumentai vadovauja kūrimo etapui, kur sukuriamas tikrasis kodas ir visi papildomi ištekliai."},
  {"start": 162.92, "end": 169.28, "text": " Galiausiai, kai testuojate ir tikrinate, jei randate problemų, sukuriate klaidų ataskaitas."},
  {"start": 169.28, "end": 177.15, "text": " Tai tarsi popierinė arba skaitmeninė dokumentacija, parodanti, kaip iš pradinės idėjos gimsta veikianti programinė įranga."},
  {"start": 181.39, "end": 182.88, "text": "Taip, man patinka ši analogija."},
  {"start": 189.48, "end": 190.1, "text": "Taip, tikrai."},
  {"start": 190.1, "end": 193.0, "text": " Šių veiklų organizavimo būdai gali būti labai skirtingi."},
  {"start": 193.0, "end": 200.63, "text": " Galite naudoti linijinį metodą, kai visos fazės vykdomos viena po kitos – pirma reikalavimai, tada projektavimas ir t. t."},
  {"start": 200.63, "end": 207.01, "text": " Tačiau galite naudoti ir iteracinius metodus, kai tam tikros veiklos kartojamos ir tobulinamos."},
  {"start": 207.01, "end": 214.53, "text": " Taip pat yra ir inkrementiniai metodai, kai programinė įranga kuriama mažais etapais, palaipsniui pridedant funkcionalumą."},
  {"start": 214.53, "end": 216.74, "text": " Taigi nėra vieno teisingo būdo tai daryti."},
  {"start": 216.74, "end": 217.98, "text": " Tai priklauso nuo projekto."},
  {"start": 220.95, "end": 229.59, "text": "Būtent. Programinės įrangos kūrimo procesų modelis – tai aprašymas, kaip visi šie elementai – veiklos, vaidmenys, artefaktai, darbo tvarka – susijungia į visumą."},
  {"start": 229.59, "end": 231.91, "text": " Kitaip tariant, tai strategija, kaip kurti programinę įrangą."},
  {"start": 248.5, "end": 250.99, "text": "Taip, krioklio modelis – tai tikras klasikinis variantas."},
  {"start": 250.99, "end": 252.85, "text": " Tai tarsi originalus planas."},
  {"start": 252.85, "end": 254.73, "text": " Įsivaizduokite tikrą krioklį."},
  {"start": 254.73, "end": 257.23, "text": " Vanduo teka tik viena kryptimi – iš viršaus į apačią."},
  {"start": 257.23, "end": 259.37, "text": " Kai jis nukrenta žemyn, negali tekėti atgal."},
  {"start": 259.37, "end": 261.13, "text": " Teisingai. Būtent tokia ir yra pagrindinė idėja."},
  {"start": 261.13, "end": 264.32, "text": " Tai linijinis, nuoseklus, labai planuotas procesas."},
  {"start": 264.32, "end": 266.34, "text": " Taigi, jis suskirstytas į aiškias fazes."},
  {"start": 266.34, "end": 279.56, "text": " Pirmiausia surenkami visi reikalavimai, tada pereinama prie projektavimo, tada įgyvendinimo – kodo rašymo, tada tikrinimo ir testavimo, o galiausiai priežiūros – klaidų taisymo ir atnaujinimų po išleidimo."},
  {"start": 282.71, "end": 283.91, "text": "Taip, būtent taip."},
  {"start": 285.58, "end": 287.96, "text": "Na, jis buvo oficialiai aprašytas"},
  {"start": 288.12, "end": 290.2, "text": "IE straipsnyje, kurį parašė Winstonas W."},
  {"start": 290.2, "end": 293.6, "text": " Royce pavadinimu: Didelių sistemų programinės įrangos kūrimo valdymas."},
  {"start": 294.62, "end": 297.26, "text": "Taip pat jis tapo itin populiarus, nes buvo įtrauktas į JAV"},
  {"start": 297.26, "end": 299.89, "text": " Gynybos departamento standartą MIL-LSTD."},
  {"start": 300.07, "end": 305.67, "text": "Taigi, jis turi ilgą istoriją, ypač dideliuose, dažnai su vyriausybe susijusiuose projektuose."},
  {"start": 310.13, "end": 316.91, "text": "Idealiu atveju jį naudotumėte tada, kai jau aiškiai ir stabiliai suprantate visus reikalavimus nuo pat pradžių."},
  {"start": 316.91, "end": 320.42, "text": " Kitaip tariant, kai tiksliai žinote, ką programinė įranga turi daryti ir šie reikalavimai nesikeis."},
  {"start": 320.42, "end": 325.06, "text": " Gerai. Taip pat technologija, kurią naudojate, ir problema, kurią sprendžiate, turėtų būti gerai suprantama."},
  {"start": 325.06, "end": 332.7, "text": " Jis taip pat gali būti naudingas labai dideliuose projektuose, kur darbus galima aiškiai padalyti, pavyzdžiui, tarp skirtingų komandų ar vietovių."},
  {"start": 340.95, "end": 343.55, "text": "Taip, didžiausia problema yra tai, kad šis modelis nėra labai lankstus."},
  {"start": 343.55, "end": 352.79, "text": " Taigi, jei jūsų supratimas apie reikalavimus nėra tobulas nuo pat pradžių arba jei jie keičiasi kūrimo metu – o taip dažnai nutinka šiandien – krioklio modelis susiduria su sunkumais."},
  {"start": 353.33, "end": 359.07, "text": "Kadangi veikianti programinės įrangos versija pasirodo tik labai vėlai, sunku anksti gauti grįžtamąjį ryšį."},
  {"start": 363.69, "end": 371.36, "text": "Būtent. Kartais žmonės bando pridėti grįžtamojo ryšio ciklus tarp fazių, kad išspręstų šią problemą, bet iš esmės tai vis tiek išlieka vienkryptis procesas."},
  {"start": 386.47, "end": 389.15, "text": "Taip, spiralės modelis turi visiškai kitokią filosofiją."},
  {"start": 389.15, "end": 392.56, "text": " Vietoj tiesios linijos čia viskas vyksta spirale, kelis kartus pereinant per tuos pačius etapus."},
  {"start": 392.56, "end": 395.6, "text": " Kiekvienas ciklas atitinka tam tikrą projekto fazę."},
  {"start": 395.6, "end": 400.8, "text": " Pagrindinis dėmesys čia skiriamas rizikai – ją identifikuoti ir sušvelninti."},
  {"start": 405.75, "end": 408.45, "text": "Taigi kiekvieną kartą pereidami spiralę, praeinate keturias pagrindines fazes."},
  {"start": 408.45, "end": 411.51, "text": " Pirmiausia nustatote to etapo tikslus."},
  {"start": 411.51, "end": 412.64, "text": " Ką norite pasiekti?"},
  {"start": 412.64, "end": 416.52, "text": " Taip pat įvertinate skirtingus požiūrius ir galimus apribojimus."},
  {"start": 416.52, "end": 418.9, "text": " Tada atliekate išsamų rizikos vertinimą."},
  {"start": 418.9, "end": 420.1, "text": " Kas gali nepavykti?"},
  {"start": 420.1, "end": 422.02, "text": " Kokios galimos problemos?"},
  {"start": 422.02, "end": 424.86, "text": " Ir sukuriate planus, kaip tas rizikas sumažinti."},
  {"start": 424.86, "end": 429.35, "text": " Tada prasideda inžinerijos fazė – realus kūrimo darbas šiame cikle."},
  {"start": 429.35, "end": 438.58, "text": " Galiausiai vyksta vertinimo fazė, kurioje peržiūrite, kas buvo atlikta, įvertinate, ar rizikos buvo tinkamai suvaldytos, ir planuojate kitą spiralės ciklą."},
  {"start": 443.97, "end": 449.07, "text": "Taip. Be to, klientas įtraukiamas nuo pat pradžių, pateikdamas grįžtamąjį ryšį kiekvieno ciklo pabaigoje."},
  {"start": 450.13, "end": 452.41, "text": "Šis modelis buvo oficialiai pristatytas"},
  {"start": 452.51, "end": 454.75, "text": "IE straipsnyje, kurį parašė Barry Boehm."},
  {"start": 454.75, "end": 459.25, "text": " Pagrindinė idėja yra sukurti sistemą palaipsniui."},
  {"start": 459.25, "end": 463.28, "text": " Tačiau tuo pat metu aktyviai valdyti ir mažinti riziką."},
  {"start": 466.63, "end": 471.52, "text": "Jis ypač tinkamas vidutinės ir aukštos rizikos projektams, ypač dideliems."},
  {"start": 471.52, "end": 477.9, "text": " Taip pat jis tinkamas, kai reikalavimai gali būti neaiškūs ar sudėtingi, arba kai tikimasi, kad jie keisis kūrimo metu."},
  {"start": 477.9, "end": 491.26, "text": " Kadangi šiame modelyje kiekviename cikle vyksta rizikos ir kaštų vertinimas, jis naudingas kai kuriuose projektuose. Be to, kadangi spiralėje dažnai naudojamas prototipavimas, šis metodas ypač tinkamas ankstyvam dizaino sprendimų išbandymui."},
  {"start": 498.97, "end": 504.41, "text": "Taip, jis paprastai geriau tinka didesniems projektams, bet gali būti per sudėtingas mažesniems, ne tokiems kompleksiškiems projektams."},
  {"start": 504.41, "end": 511.0, "text": " Taip pat reikalinga patirtis vertinant rizikas, kitaip tariant, gebėjimas jas nustatyti ir efektyviai mažinti."},
  {"start": 511.0, "end": 518.1, "text": " Kadangi šis modelis yra iteracinis ir orientuotas į rizikos valdymą, jis gali reikalauti daugiau dokumentacijos ir gero projekto valdymo."},
  {"start": 518.1, "end": 520.92, "text": " Jis tikrai sudėtingesnis nei krioklio modelis."},
  {"start": 530.95, "end": 538.23, "text": "Taigi, kaip modelis, prototipavimas yra apie reikalavimų ar dizaino patvirtinimą kuriant veikiančius prototipus ankstyvoje stadijoje."},
  {"start": 540.89, "end": 546.67, "text": "Teisingai. Svarbu suprasti, kad prototipas yra ankstyva, dažnai neišbaigta programinės įrangos versija."},
  {"start": 546.67, "end": 552.64, "text": " Jis naudojamas tam tikriems aspektams išbandyti, pavyzdžiui, vartotojo sąsajai ar pagrindinėms funkcijoms."},
  {"start": 552.64, "end": 555.74, "text": " Galima įsivaizduoti kaip greitai sukurtą, veikiantį eskizą."},
  {"start": 560.5, "end": 564.82, "text": "Taip, būtent. Prototipavimo idėja programinės įrangos kūrime egzistuoja jau ilgą laiką."},
  {"start": 564.82, "end": 568.81, "text": " Frederickas Brooksas apie tai rašė savo knygoje The Mythical Man-Month."},
  {"start": 568.93, "end": 571.81, "text": "Įdomu. Bet štai kas svarbu."},
  {"start": 571.81, "end": 582.59, "text": " Nors prototipavimas yra itin dažnai naudojama technika įvairiuose modeliuose, pats prototipavimo modelis ne visada naudojamas kaip pagrindinis viso projekto karkasas."},
  {"start": 588.59, "end": 590.45, "text": "Yra keletas jo variacijų."},
  {"start": 590.45, "end": 600.66, "text": " Yra vienkartinis prototipavimas, kai prototipas kuriamas tik tam, kad padėtų išsiaiškinti reikalavimus ar dizaino sprendimus, o vėliau išmetamas ir visa sistema kuriama iš naujo."},
  {"start": 600.66, "end": 607.48, "text": " Tada yra evoliucinis prototipavimas, kai prototipas nuolat tobulinamas ir plėtojamas, kol tampa galutine sistema."},
  {"start": 608.46, "end": 615.38, "text": "Taip pat yra inkrementinis prototipavimas, kai sistema kuriama kaip atskirų prototipų serija, palaipsniui pridedant naujas funkcijas."},
  {"start": 615.38, "end": 624.71, "text": " Galiausiai yra ekstremalus prototipavimas, dažnai naudojamas interneto svetainių kūrime, kur pirmiausia kuriama pagrindinė vartotojo sąsaja, o vėliau pridedama verslo logika ir paslaugos."},
  {"start": 631.08, "end": 635.34, "text": "Taigi paprastai pradedi nuo tam tikrų pradinių reikalavimų surinkimo – tik aukšto lygio dalykų."},
  {"start": 635.34, "end": 638.9, "text": " Tada greitai sukuri ir suprojektuoji prototipą pagal tuos reikalavimus."},
  {"start": 638.9, "end": 643.29, "text": " Tu parodai prototipą suinteresuotoms šalims, dažniausiai vartotojams, ir gauni jų grįžtamąjį ryšį."},
  {"start": 643.29, "end": 652.48, "text": " Remdamasis tuo atsiliepimu, gali arba tobulinti prototipą naujoje iteracijoje, arba, jei jis pakankamai geras, pereiti prie tolesnio vystymo, priklausomai nuo prototipavimo tipo."},
  {"start": 652.48, "end": 655.14, "text": " Šis ciklas gali kartotis, kol visi lieka patenkinti."},
  {"start": 664.64, "end": 668.65, "text": "Vienas didžiausių privalumų – klientas įtraukiamas į procesą nuo pat pradžių."},
  {"start": 668.65, "end": 675.03, "text": " Kadangi jam anksti parodomas veikiančio produkto modelis ir reguliariai gaunamas jo grįžtamasis ryšys, geriau suprantami jo poreikiai."},
  {"start": 675.03, "end": 681.43, "text": " Taip pat lengviau pastebėti trūkstamas funkcijas ir prisitaikyti prie besikeičiančių reikalavimų."},
  {"start": 681.43, "end": 684.74, "text": " Tai padeda sumažinti riziką sukurti netinkamą produktą."},
  {"start": 691.4, "end": 692.18, "text": "Taip, be abejo."},
  {"start": 692.18, "end": 695.78, "text": " Planavimas gali būti sudėtingas, nes iš anksto nežinai, kiek iteracijų reikės."},
  {"start": 695.78, "end": 702.03, "text": " Taip pat yra rizika pernelyg skubėti kuriant prototipą ir nepakankamai analizuoti reikalavimus."},
  {"start": 702.03, "end": 705.97, "text": " Gali būti nepastebėti svarbūs aspektai, tokie kaip saugumas ar našumas."},
  {"start": 707.05, "end": 715.48, "text": "O naudojant evoliucinį prototipavimą, kai prototipas tampa galutiniu produktu, sistema gali tapti chaotiška, jei ji buvo pradėta per greitai."},
  {"start": 715.48, "end": 720.62, "text": " Be to, dokumentacija gali būti problema, nes visi koncentruojasi į prototipo kūrimą."},
  {"start": 720.62, "end": 725.88, "text": " Kartais klientai gali nesuprasti, kad prototipas dar nėra galutinis produktas."},
  {"start": 728.75, "end": 732.97, "text": "Šis metodas ypač naudingas, kai reikalavimai yra neaiškūs, sudėtingi arba gali keistis."},
  {"start": 732.97, "end": 737.92, "text": " Jis taip pat geras, kai naudojamos naujos technologijos ir reikia įrodyti jų veikimą praktikoje."},
  {"start": 737.92, "end": 744.64, "text": " Taip pat labai tinka kuriant vartotojo sąsajas ar interaktyvias sistemas, kuriose vartotojų grįžtamasis ryšys yra itin svarbus."},
  {"start": 756.84, "end": 761.32, "text": "RUP tikrai yra detalesnis ir labiau struktūruotas, kaip ir spiralinis bei prototipavimo modeliai."},
  {"start": 761.32, "end": 769.56, "text": " Jis yra iteracinis ir inkrementinis, tačiau taip pat orientuotas į architektūrą ir grindžiamas šešiomis geriausiomis programinės įrangos kūrimo praktikomis."},
  {"start": 772.76, "end": 790.08, "text": "Taigi, šešios geriausios RUP praktikos yra: programinės įrangos kūrimas iteratyviai, efektyvus reikalavimų valdymas, komponentinės architektūros naudojimas, vizualus programinės įrangos modeliavimas, pavyzdžiui, naudojant UML diagramas, nuolatinis kokybės tikrinimas testuojant ir programinės įrangos pokyčių valdymas viso proceso metu."},
  {"start": 794.94, "end": 805.75, "text": "Taip, būtent. RUP taip pat yra orientuotas į rizikų valdymą ir lankstumą, todėl jį galima pritaikyti skirtingiems projektams – jis gali būti labiau planuojamas arba labiau pritaikytas agile metodikai, priklausomai nuo poreikių."},
  {"start": 812.47, "end": 814.74, "text": "Jis suskirstytas į keturias pagrindines fazes."},
  {"start": 814.74, "end": 822.82, "text": " Pirmoji – įžanginė fazė, kurioje nustatoma projekto apimtis, atliekamas pradinis planavimas ir sąnaudų vertinimas."},
  {"start": 822.82, "end": 824.32, "text": " Tai paprastai užtrunka apie"},
  {"start": 824.86, "end": 825.98, "text": "viso projekto laiko."},
  {"start": 825.98, "end": 833.95, "text": " Tuomet seka detalizavimo fazė, kurios metu gilinamasi į reikalavimus, mažinamos pagrindinės rizikos ir kuriamas detalesnis planas."},
  {"start": 833.95, "end": 835.25, "text": " Tai gali užtrukti apie"},
  {"start": 835.35, "end": 835.69, "text": "projekto laiko."},
  {"start": 835.69, "end": 842.46, "text": " Tada prasideda kūrimo fazė, kurioje atliekamas didžioji dalis programinės įrangos kūrimo darbų."},
  {"start": 842.46, "end": 843.96, "text": " Tai paprastai didžiausia dalis, apie"},
  {"start": 844.7, "end": 845.16, "text": "viso darbo."},
  {"start": 845.16, "end": 851.91, "text": " Galiausiai pereinama prie perėjimo fazės, kai programinė įranga diegiama vartotojams ir užtikrinama, kad ji veiktų tinkamai realiame pasaulyje."},
  {"start": 851.91, "end": 852.93, "text": " Tai paprastai paskutinė"},
  {"start": 859.6, "end": 860.6, "text": "Tai tikrai iteracinis procesas."},
  {"start": 860.6, "end": 863.44, "text": " Kiekvienoje fazėje vyksta kelios iteracijos."},
  {"start": 863.44, "end": 870.37, "text": " Pavyzdžiui, detalizavimo fazėje gali būti kelios iteracijos, skirtos skirtingoms reikalavimų ar dizaino dalims."},
  {"start": 870.37, "end": 876.57, "text": " Kas taip pat išskiria RUP, tai devynios disciplinos, kurios yra taikomos visose fazėse."},
  {"start": 877.21, "end": 879.01, "text": "Taip, tarsi skirtingos darbo sritys."},
  {"start": 879.01, "end": 889.74, "text": " Tai tokios sritys kaip verslo modeliavimas, reikalavimai, analizė ir dizainas, įgyvendinimas, testavimas, diegimas, konfigūracijos ir pokyčių valdymas, projekto valdymas ir aplinka."},
  {"start": 890.9, "end": 898.86, "text": "Taip. Tai tarsi darbo srautai, kurie veikia viso projekto metu, tačiau kiekvienoje fazėje jų svarba gali keistis."},
  {"start": 898.86, "end": 908.38, "text": " Pavyzdžiui, reikalavimų rinkimas yra ypač svarbus įžanginėje ir detalizavimo fazėse, o įgyvendinimas tampa pagrindiniu kūrimo etape."},
  {"start": 914.53, "end": 918.94, "text": "Jis dažnai pasirenkamas, kai tikimasi, kad reikalavimai gali keistis, nes jis sukurtas būti lankstus."},
  {"start": 918.94, "end": 925.22, "text": " Taip pat jis naudingas, kai reikia geros dokumentacijos viso projekto metu, kas yra svarbu kai kuriose pramonės šakose ar didelėse įmonėse."},
  {"start": 925.22, "end": 931.05, "text": " Ir jis puikiai tinka projektams, kuriuose reikia dažnai integruoti skirtingas programinės įrangos dalis, ypač kūrimo metu."},
  {"start": 935.43, "end": 938.44, "text": "Vienas iš iššūkių yra tai, kad jį gali būti gana sudėtinga įgyvendinti."},
  {"start": 938.44, "end": 942.42, "text": " Reikia patyrusių komandos narių, kurie tikrai suprastų, kaip jis veikia."},
  {"start": 942.42, "end": 952.31, "text": " Jis taip pat buvo kritikuojamas dėl per mažo dėmesio žmogaus faktoriui, pavyzdžiui, bendradarbiavimui ir komandiniam darbui, kuriuos labiau pabrėžia agile metodai."},
  {"start": 952.31, "end": 958.37, "text": " Ir kadangi jis labai išsamus, jis kartais gali atrodyti kaip per didelė našta, ypač mažesniems projektams."},
  {"start": 970.22, "end": 977.54, "text": "Taip, būtent. Programinės įrangos proceso tobulinimas yra apie viso kūrimo proceso gerinimą, kad jis būtų efektyvesnis ir veiksmingesnis."},
  {"start": 977.54, "end": 982.76, "text": " Tikslas – pagerinti programinės įrangos kokybę, sumažinti sąnaudas ir greičiau pristatyti naują programinę įrangą."},
  {"start": 991.19, "end": 992.47, "text": "Yra du pagrindiniai požiūriai."},
  {"start": 992.47, "end": 998.92, "text": " Vienas yra proceso brandos modelis, kuris orientuotas į bendrą procesų ir projektų valdymo gerinimą."},
  {"start": 998.92, "end": 1005.03, "text": " Kitas – agile metodikos, kurios pabrėžia iteracinį vystymą, bendradarbiavimą ir nuolatinį grįžtamąjį ryšį."},
  {"start": 1008.77, "end": 1011.07, "text": "Vienas iš dažniausiai naudojamų metodų yra matuoti, analizuoti, keisti."},
  {"start": 1011.07, "end": 1014.33, "text": " Pirmiausia, išmatuojate kažką, kas susiję su jūsų procesu ar programine įranga."},
  {"start": 1014.33, "end": 1024.7, "text": " Pavyzdžiui, kiek laiko užtrunka atlikti tam tikrą veiksmą, kaip išbandyti naują funkciją, kiek resursų sunaudojama, kiek klaidų randama ar kiek pakeitimų prašymų gaunama po išleidimo."},
  {"start": 1024.7, "end": 1029.17, "text": " Gerai. Tada analizuojate tuos duomenis, kad nustatytumėte silpnąsias vietas ir galimybes tobulėjimui."},
  {"start": 1029.17, "end": 1030.85, "text": " Remdamiesi tuo, atliekate pakeitimus."},
  {"start": 1030.85, "end": 1033.39, "text": " Ir tada vėl matuojate, kad patikrintumėte, ar pakeitimai buvo veiksmingi."},
  {"start": 1033.39, "end": 1035.89, "text": " Tai nuolatinis tobulėjimo ciklas."},
  {"start": 1043.6, "end": 1048.35, "text": "CMM yra būdas apibūdinti, kiek brandus yra organizacijos programinės įrangos kūrimo procesas."},
  {"start": 1048.35, "end": 1050.09, "text": " Yra penki lygiai."},
  {"start": 1050.09, "end": 1053.89, "text": " Pradiniame lygyje viskas yra gana chaotiška ir nenuspėjama."},
  {"start": 1053.89, "end": 1060.21, "text": " Valdomame lygyje projektai yra suplanuoti ir kontroliuojami, tačiau vis dar gali nebūti standartizuotų procesų visoje organizacijoje."},
  {"start": 1060.21, "end": 1065.57, "text": " Apibrėžtame lygyje egzistuoja standartizuoti procesai, kurie yra dokumentuoti ir taikomi visur."},
  {"start": 1065.57, "end": 1070.65, "text": " Kvantitatiškai valdomame lygyje naudojami duomenys procesui kontroliuoti ir tobulinti."},
  {"start": 1070.65, "end": 1076.18, "text": " O optimizavimo lygyje vyksta nuolatinis tobulinimas ir inovacijos, nuolat ieškoma būdų, kaip tapti dar geresniais."},
  {"start": 1080.44, "end": 1081.52, "text": "Taip, geras apibūdinimas."},
  {"start": 1086.46, "end": 1090.62, "text": "Taip, viena iš kritikų yra ta, kad šis metodas gali būti labai biurokratinis, ypač mažoms įmonėms."},
  {"start": 1090.62, "end": 1096.34, "text": " Tai gali reikšti daugybę dokumentacijos ir formalių procesų, kurie ne visiems yra būtini."},
  {"start": 1096.34, "end": 1099.86, "text": " Iš pradžių jis buvo sukurtas vertinti vyriausybės rangovus."},
  {"start": 1099.86, "end": 1105.12, "text": " Kai kurie žmonės teigia, kad įmonės realūs pasiekimai yra svarbesni nei jų CMMI lygis."},
  {"start": 1112.96, "end": 1113.4, "text": "Būtent."},
  {"start": 1136.56, "end": 1141.28, "text": "Supratimas apie skirtingus modelius yra labai naudingas visiems, kurie dirba su programinės įrangos kūrimu."},
  {"start": 1141.28, "end": 1146.57, "text": " Tai padeda priimti geresnius sprendimus dėl projekto vykdymo ir pasirinkti tinkamiausią metodiką skirtingoms situacijoms."},
  {"start": 1169.16, "end": 1169.54, "text": "Buvo smagu."},
  {"start": 1174.1, "end": 1174.68, "text": "Iki kito karto."}
]